app/controllers/uploader/pictures_controller.rb

  def index
    @pictures = Picture.find_all_by_user_id(current_user.id)
---
SELECT `pictures`.* FROM `pictures` WHERE `pictures`.`user_id` = 3

  def create
    @flag = params[:enc]
    @file_exist = false

    @user_id = current_user.id
    p_attr = params[:picture]
    p_attr[:user_id] = @user_id
    p_attr[:file] = params[:picture][:file].first if params[:picture][:file].class == Array

    if @flag == "true"
      p_attr[:key] = generate_key
    else
      p_attr[:key] = 0
    end

    @picture = Picture.new(p_attr)
    @maybe_copy = Picture.find_by_file(@picture.file.filename)
    if @maybe_copy != nil
      if (@maybe_copy.file != nil)
        @file_exist = true
        @maybe_copy.destroy
      end
    end

    if @flag == "true"
      encryption(@picture.file.file.file, @picture.key)
    end

    if @picture.save
---
SELECT `pictures`.* FROM `pictures` WHERE `pictures`.`file` = 'rocky.jpg' LIMIT 1
DELETE FROM `pictures` WHERE `pictures`.`id` = ?  [["id", 476]]
INSERT INTO `pictures` (`file`, `key`, `user_id`) VALUES (?, ?, ?)  [["file", "rocky.jpg"], ["key", "\x13\x11};\x1E6fw\x1Dd2\x17/\x02\x14;kD\\mh$\x17a[\x01'd5M3j"], ["user_id", 3]]

  def destroy
    @picture = Picture.find(params[:id])
    @picture.destroy
---
SELECT `pictures`.* FROM `pictures` WHERE `pictures`.`id` = ? LIMIT 1  [["id", "474"]]
DELETE FROM `pictures` WHERE `pictures`.`id` = ?  [["id", 474]]

  def destroy_by_name
    @picture = Picture.find_by_file(params[:file])
    @picture.destroy
---
SELECT `pictures`.* FROM `pictures` WHERE `pictures`.`file` = 'wallace_0506_1024.jpg' LIMIT 1
DELETE FROM `pictures` WHERE `pictures`.`id` = ?  [["id", 512]]

  def upload

    @flag = params[:enc]
    @file_exist = false

    @user_id = params[:id]
    p_attr = Hash.new
    p_attr[:user_id] = @user_id
    p_attr[:file] = params[:file]

    if @flag == "true"
      p_attr[:key] = generate_key
    else
      p_attr[:key] = 0
    end

    @picture = Picture.new(p_attr)
    @maybe_copy = Picture.find_by_file(@picture.file.filename)
    if @maybe_copy != nil
      if (@maybe_copy.file != nil)
        @file_exist = true
        @maybe_copy.destroy
      end
    end

    if @flag == "true"
      encryption(@picture.file.file.file, @picture.key)
    end

    if @picture.save
---
SELECT `pictures`.* FROM `pictures` WHERE `pictures`.`file` = 'wallace_0506_1024.jpg' LIMIT 1
INSERT INTO `pictures` (`file`, `key`, `user_id`) VALUES (?, ?, ?)  [["file", "wallace_0506_1024.jpg"], ["key", 0], ["user_id", 3]]