app/controllers/serviceexecution/account_controller.rb

SELECT `pictures`.* FROM `pictures` WHERE `pictures`.`user_id` = 3
---
  def showuser
    files_paths = Array.new
    if current_user != nil
      user_id = current_user.id
    else
      user_id = params[:id]
    end
    files_paths.push(user_id)
    files = Picture.find_all_by_user_id(user_id)

SELECT `pictures`.* FROM `pictures` WHERE `pictures`.`file` = 'rocky.jpg' LIMIT 1
---
  def request_file_size
    if (current_user) != nil
      user_id = current_user.id
    else
      user_id = params[:id]
    end
    base_url = "public/FILES/#{user_id}/"

    file = Picture.find_by_file(params[:path])

SELECT `pictures`.* FROM `pictures` WHERE `pictures`.`file` = 'rocky.jpg' LIMIT 1
---
  def download
    require "crypto/encript"

    if (current_user) != nil
      user_id = current_user.id
    else
      user_id = params[:id]
    end
    base_url = "public/FILES/#{user_id}/"
    dec_url = "public/FILES/#{user_id}/tmp/"

    check_dec_dir(dec_url)

    file = Picture.find_by_file(params[:path])